@extends('parts.auth-master')
@section('title', 'ثبت نام')
@section('head-styles')
    <link rel="stylesheet" href="{{ asset('assets/vendor/css/pages/page-auth.css') }}">
@stop
@section('content')
    <div class="app-brand justify-content-center">
        <img src="assets/img/logo.png">
    </div>
    <h4 class="mb-3 text-center secondary-font">{{ __('ثبت نام') }}</h4>
    <div id="formAuthentication" class="mb-3">
        <div class="row">
            <div class="col-sm-6 col-xs-12 mb-3">
                <label for="name" class="form-label">{{ __('نام') }} <span class="text-danger">*</span></label>
                <input type="text" class="form-control text-start checkEmpty persianletters" id="name"
                    name="name" placeholder="{{ __('نام') }}..." value="{{ old('name') }}">
            </div>
            <div class="col-sm-6 col-xs-12 mb-3">
                <label for="famliy" class="form-label">{{ __('نام خانوادگی') }} <span class="text-danger">*</span></label>
                <input type="text" class="form-control text-start checkEmpty persianletters" id="family"
                    name="family" placeholder="{{ __('نام خانوادگی') }}..." value="{{ old('family') }}">
            </div>
        </div>
        <div class="row">
            <div class="col-sm-6 col-xs-12 mb-3">
                <label for="phone" class="form-label">{{ __('تلفن ثابت') }} <span class="text-danger">*</span></label>
                <input type="text" class="form-control text-start checkEmpty just-numbers" id="phone" name="phone"
                    placeholder="{{ __('تلفن ثابت') }}..." value="{{ old('phone') }}" maxlength="11">
            </div>
            <div class="col-sm-6 col-xs-12 mb-3">
                <label for="mobile" class="form-label">{{ __('موبایل') }} <span class="text-danger">*</span></label>
                <input type="text" class="form-control text-start checkEmpty just-numbers checkMobile" id="mobile"
                    name="mobile" placeholder="{{ __('موبایل') }}..." value="{{ old('mobile') }}" maxlength="11">
            </div>
        </div>
        <div class="row">
            <div class="col-12 mb-3">
                <label for="center" class="form-label">{{ __('نام مجموعه') }} <span class="text-danger">*</span></label>
                <input type="text" class="form-control text-start checkEmpty persianletters" id="center"
                    name="center" placeholder="{{ __('نام مجموعه') }}..." value="{{ old('center') }}">
            </div>
        </div>
        <div class="row">
            <div class="col-sm-6 col-xs-12 mb-3">
                <label for="city" class="form-label">{{ __('استان') }} <span class="text-danger">*</span></label>
                <input type="text" class="form-control text-start checkEmpty persianletters" id="city"
                    name="city" placeholder="{{ __('استان') }}..." value="{{ old('city') }}">
            </div>
            <div class="col-sm-6 col-xs-12 mb-3">
                <label for="town" class="form-label">{{ __('شهر') }} <span class="text-danger">*</span></label>
                <input type="text" class="form-control text-start checkEmpty persianletters" id="town"
                    name="town" placeholder="{{ __('شهر') }}..." value="{{ old('town') }}">
            </div>
        </div>
        <div class="row">
            <div class="col-12 mb-3">
                <label for="address" class="form-label">{{ __('آدرس') }} <span class="text-danger">*</span></label>
                <input type="text" class="form-control text-start checkEmpty" id="address" name="address"
                    placeholder="{{ __('آدرس') }}..." value="{{ old('address') }}">
            </div>
        </div>
        <div class="row">
            {{-- <div class="col-sm-6 col-xs-12 mb-3">
                <label for="username" class="form-label">{{ __('نام کاربری') }} <span class="text-danger">*</span></label>
                <input type="text" class="form-control text-start checkEmpty" id="r-username" name="r_username" placeholder="{{ __('نام کاربری') }}..." value="{{ old('usrername') }}">
            </div> --}}
            <div class="col-sm-12 col-xs-12 form-password-toggle mb-3">
                <label for="password" class="form-label">{{ __('رمز ورود') }} <span class="text-danger">*</span></label>
                <div class="input-group input-group-merge">
                    <input type="password" id="r-password" class="form-control text-start checkEmpty" name="r_password"
                        placeholder="{{ __('رمز ورود') }}..." aria-describedby="password" dir="ltr">
                    <span class="input-group-text cursor-pointer"><i class="bx bx-hide"></i></span>
                </div>
            </div>
        </div>
        <div class="mb-3">
            <div class="form-check">
                <input class="form-check-input" type="checkbox" id="terms-conditions" name="terms">
                <label class="form-check-label" for="terms-conditions">
                    {{ __('من با') }}
                    <a href="#" data-bs-toggle="modal" data-bs-target="#policy-modal">
                        {{ __('قوانین استفاده از نرم افزار') }}</a>
                    {{ __('موافقم.') }}
                </label>
            </div>
        </div>
        <button id="save-register" class="btn btn-primary d-grid w-100 submit-by-enter">{{ __('عضویت') }}</button>
    </div>
    <p class="text-center">
        <span>{{ __('حساب کاربری دارید؟') }}</span>
        <a href="{{ route('login') }}">
            <span>{{ __('وارد شوید.') }}</span>
        </a>
    </p>
@endsection
<div class="modal fade" id="policy-modal" aria-hidden="true">
    <div class="modal-dialog modal-dialog-centered modal-xl">
        <div class="modal-content p-3 p-md-5">
            <div id="policy-result">
                <button type="button" class="btn-close btn-pinned" data-bs-dismiss="modal"
                    aria-label="Close"></button>
                <div class="modal-body">
                    <div class="app-brand justify-content-center">
                        <img src="assets/img/logo.png">
                    </div>
                    {!! App\Models\Admin\Option::get_option('roles') !!}
                    {{-- <div class="row">
                        <h2 class="text-center">{{ __('توافقنامه استفاده از نرم افزار هلی سافت') }}</h2>
                        <p>
                            این توافقنامه، شرایط و ضوابط حاکم بر ارائه کلیه خدمات در بسته ها و طرح های مجموعه نرم
                            افزاری هلی سافت می
                            باشد. این خدمات بدون تغییر بر اساس ضوابط و شرایط مندرج در این سایت و سایر قوانین جاری که
                            توسط شما
                            پذیرفته شده، ارائه می گردد. شرایط ذیل یک قرارداد قانونی الزام آور بین شما به عنوان مشتری
                            و شرکت آرشا
                            سیستم جوان گرا تک که در این قرارداد به عنوان هلی سافت خواهد شد، می باشد:
                        </p>
                        <br>
                        <ul class="mr-4">
                            <li>وقتی شما به نمایندگی از کارفرما یا شخص حقوقی و یا بعنوان کارمند وارد و شرایط را قبول
                                نمائید، این امر
                                نشان دهنده این است که اختیارات لازم برای انجام این امر را در اختیار داشته اید.</li>
                            <li>زدن تیک تایید، نشانگر این است که شما تمامی شرایط حاضر در این توافقنامه را در صحت و
                                سلامت کامل مطالعه
                                و قبول نموده اید.</li>
                            <li>در صورت نقض شرایط و قوانین، هلی سافت میتواند با صلاحدید خود نسبت به تعلیق یا دسترسی
                                شما اقدام نماید.
                            </li>
                            <li>شما در دوره رایگان و آزمایشی استفاده از نرم افزار نیز متعهد به رعایت مفاد این
                                توافقنامه می باشید.
                            </li>
                        </ul>
                    </div>
                    <div class="row">
                        <h3 class="w-100">1- تعاریف</h3><br>
                        <p class="w-100"><b>مشتری: </b>شخص حقیقی یا حقوقی که شرایط استفاده از خدمات هلی سافت را
                            پذیرفته است.</p>
                        <br>
                        <p class="w-100"><b>داده های مشتری: </b>تمامی دیتا و اطلاعاتی که توسط مشتری در سیستم قرار
                            گرفته است.</p>
                        <br>
                        <p class="w-100"><b>فایل ها: </b>هر نوع از اسناد (شامل تصاویر، پرونده ها و ...) که توسط
                            مشتری در سیستم وارد
                            می شود.</p><br>
                        <p class="w-100"><b>دوره رایگان یا آزمایشی: </b>دسترسی موقت بدون پرداخت هزینه که هلی سافت
                            در اختیار مشتریان
                            خود قرار داده است.</p><br>
                        <p class="w-100"><b>دستورالعمل ها: </b>دستورالعمل ها یا قوانین جدید که در مواقع لزوم از
                            طریق هلی سافت در
                            اختیار مشتری قرار خواهد گرفت.</p><br>
                        <p class="w-100"><b>خدمات: </b>عبارت است از کلیه خدمات، محصولات، سیستم و محتوای موجود در
                            نرم افزار هلی
                            سافت.</p><br>
                        <p class="w-100"><b>سیستم: </b>تمامی نرم افزارها، پایگاه داده، رابط ها، رسانه های مرتبط،
                            اسناد، به روز
                            رسانی ها، نسخه جدید و سایر اجزا در پلتفرم هلی سافت به صورت پردازش ابری می باشد.</p><br>
                        <p class="w-100"><b>کاربر: </b>یک شخص حقیقی و یا حقوقی که از طریق صدور شناسه و گذرواژه از
                            جانب مشتری مجاز
                            به استفاده از هلی سافت است.</p><br>
                        <p class="w-100"><b>هلی سافت: </b>نرم افزار مدیریت خانه بازی که در دامنه helionline.ir به
                            صورت پردازش ابری به
                            مشتری ارائه میگردد.</p><br>
                        <p class="w-100"><b>شرکت: </b>شرکت آرشا سیستم جوان گرا تک با شناسه ملی 14009519195 به
                            نشانی: کرمان، بلوار
                            آزادگان، نبش کوچه 16، طبقه همکف</p><br>
                        <p class="w-100"><b>قوانین: </b>”قانون تجارت الکترونیک”، “قانون جرایم رایانه ای”، “قانون
                            حمایت از حقوق
                            پدیدآورندگان نرم افزارهای رایانه ای” و سایر قوانین مربوطه </p><br>
                    </div>
                    <div class="row">
                        <h3>2- شرایط ورود و استفاده از خدمات هلی سافت</h3><br>
                        <p>استفاده از خدمات هلی سافت منوط به پذیرش توافقنامه (تیک زدن) به همراه سایر شرایط است.
                            اشخاص حقوقی نیز
                            بایستی در شرایط قانونی و مطلوب باشند و بر اساس قوانین و عمومات حقوقی منعی برای استفاده
                            از این محصول را
                            نداشته باشند.</p><br>
                    </div>
                    <div class="row">
                        <h3 class="w-100">3- دوره آزمایشی رایگان</h3><br>
                        <p class="w-100">هر شخص حقیقی و یا حقوقی می تواند با قبول شرایط هلی سافت و انتخاب پکیج
                            رایگان به مدت 14 روز
                            بصورت آزمایشی از خدمات ما استفاده نماید، در صورت نیاز، مشتری می تواند پس از اتمام دوره
                            فوق، خدمات مورد
                            نیاز هلی سافت را، بر اساس جداول انتخاب و خریداری نمایید، در غیر اینصورت حساب کاربری بطور
                            خودکار غیر فعال
                            می شود و اگر مشتری تا شش ماه از پایان دوره رایگان هزینه حساب کاربری را طبق جدول در صفحه
                            تمدید پرداخت
                            ننماید شرکت حق حذف حساب دائمی و کلیه اطلاعات و داده های مشتری را خواهد داشت.</p><br>
                    </div>
                    <div class="row">
                        <h3 class="w-100">4- مراحل استفاده از خدمات هلی سافت</h3><br>
                        <h4 class="w-100">4-1 ایجاد حساب کاربری</h4><br>
                        <p>ویژگیها، عملکردها، قطعات و یا تمامی سرویسهای هلی سافت فقط توسط دارندگان حساب کاربری در
                            دسترس است و شخصی
                            که مایل به ایجاد حساب کاربری است باید:</p><br>
                        <p>بعد از تکمیل ثبت نام با کلیک بر روی دکمه تیک پذیرش، شرایط را قبول نماید، بدیهی است ایجاد
                            حساب بایستی توسط
                            یک شخص حقیقی ایجاد و ثبت نام با ابزارهایی همانند bots مجاز نمی باشد.</p><br>
                        <p>در صورتی که مشتری در حساب کاربری خود نیاز به حضور و استفاده چند کاربر را داشته باشد
                            بایستی به هلی سافت
                            دعوت نموده و شرکت در قبال این معرفی هیچگونه مسئولیتی در تایید اعتبار کاربران جدید را
                            ندارد.</p><br>

                        <h4 class="w-100">4-2 ورود به سیستم یک حساب</h4><br>
                        <p>مشتری پس از ثبت نام و ایجاد حساب کاربری، یک نام کاربری و رمز عبور به خود اختصاص داده تا
                            از آن برای ورود
                            به حساب خود استفاده نماید، سپس میتواند در صورت لزوم، کاربرانی را به سیستم خود اضافه
                            نماید و به آنها
                            اجازه دسترسی به سیستم را بدهد و در این موارد هیچگونه مسئولیتی متوجه شرکت نبوده و نیست و
                            تمامی مسئولیت
                            حفظ اطلاعات و اسناد و داده هایی که مشتری در اختیار کاربر خود قرار داده با وی میباشد و در
                            صورت خروج کاربر
                            از سیستم مشتری، وی مسئول غیر فعال کردن اکانت آن کاربر است.</p><br>

                        <h4 class="w-100">4-3 خاتمه حساب</h4><br>
                        <p>اطلاعات حساب مشتری تا ۶ ماه پس از اتمام مدت همکاری و عدم تمدید حساب کاربری توسط ایشان نزد
                            شرکت محفوظ و
                            سپس به صورت خودکار حذف و غیر قابل برگشت خواهد بود.</p><br>

                        <h4 class="w-100">4-4 هزینه ها</h4><br>
                        <p>پس از انتخاب و ثبت نام برای یک حساب کاربری مشتری بایستی هزینه را بر اساس جدول در صفحه
                            تمدید و ارتقا در
                            حساب کاربری، پرداخت نماید و پس از پرداخت، هزینه ها غیر قابل استرداد می باشد حتی در صورت
                            عدم استفاده از
                            سیستم و یا غیر فعال کردن آن. بدیهی ست اگر مشتری در اواسط دوره استفاده، تصمیم به ارتقاء
                            سیستم بگیرد،
                            هزینه های این موضوع بر عهده وی خواهد بود. کلیه هزینه ها شامل مالیات، عوارض، یا عوارض
                            قابل اعمال تحت هر
                            قانون قابل اجرا است که بایستی توسط مشتری پرداخت گردد. پرداخت ها به شرکت از طریق درگاه
                            پرداخت اینترنتی،
                            چک و یا حواله بانکی قابل انجام می باشد.</p><br>
                    </div>
                    <div class="row">
                        <h3 class="w-100">5- تغییر در خدمات</h3><br>
                        <p>شرکت بنا به صلاحدید خود در صورت لزوم این حق را دارد که هر زمان در بسته ها یا طرح های هلی
                            سافت را تغییر،
                            اصلاح، اضافه و یا حذف کند و در صورتیکه شما مشتری هلی سافت باشید این تغییرات شامل حال شما
                            نیز خواهد بود.
                        </p>
                        <br>
                        <p>– لطفا به صورت دوره ای «توافقنامه استفاده از خدمات هلی سافت» را مطالعه فرمایید تا متوجه
                            تغییرات شوید.</p>
                    </div>
                    <div class="row">
                        <h3 class="w-100">6- مسئولیت های هلی سافت</h3><br>
                        <ul class="mr-4">
                            <li> پشتیبانی لازم برای استفاده از خدمات هلی سافت مسئولیت ما و به صورت 24 ساعت شبانه روز
                                و هفت روز هفته
                                می باشد. مگر در صورتی که شرایط فورس ماژور مانند اتفاقات خارج از اراده و غیر قابل
                                کنترل از جمله سیل،
                                زلزله، آتش سوزی، ناآرامی های داخلی، اقدامات دولت، اعتصاب، تحریم،خرابی برنامه ریزی
                                شده و یا حمله به
                                خدمات اینترنتی و غیره اتفاق بیافتد و مانع ارائه خدمات گردد.</li>
                            <li>همکاران شرکت از طریق پاسخگویی به سوالات و رفع مشکلاتی که در حین استفاده از هلی سافت
                                ممکن است بوجود
                                بیاید پشتیبانی لازم توسط تلفن ۰۹۳۹۲۰۰۱۴۵۶ و سامانه گفتگوی آنلاین مستقر در دامنه اصلی
                                سرویس، در
                                روزهای کاری هفته شنبه تا چهارشنبه (۸ الی ۱۵) و پنج شنبه (۸ الی ۱۳) را بعمل خواهد
                                آورد. </li>
                            <li>
                                شرکت محافظت های لازم به صورت فیزیکی و یا فنی برای حفاظت از امنیت داده های مشتری را
                                تا جایی که بر
                                خلاف قوانین نباشد را به انجام میرساند. این ضمانت شامل اقدامات لازم جهت جلوگیری از
                                دسترسی استفاده،
                                تغییر و یا افشای اطلاعات مشتری می باشد مگر در موارد زیر:<br>
                                <b>حکم مراجع قضایی</b>
                                و
                                <b>در صورت اجازه کتبی مشتری به شرکت</b>
                            </li>
                            <li>
                                شرکت هیچ گونه مسئولیتی نسبت به ناتوانی مشتری در استفاده از خدمات و یا دسترسی غیر
                                مجاز شخص ثالث به
                                اطلاعات وی از طریق داشتن گذرواژه و ورود به حساب کاربری و همچنین مشکلات مربوط به
                                اینترنت که باعث
                                مشکلاتی در ارائه خدمت می شود را، ندارد. تشخیص این موضوع با استفاده از لاگ ثبت شده در
                                سیستم و بر عهده
                                شرکت خواهد بود.
                                <br>
                                لازم به ذکر است: با توجه به اینکه شرکت به هیچ عنوان دسترسی به گذرواژه مشتری را
                                ندارد. جهت رفع مشکلات
                                و نگهداری از سیستم، در مواقع لزوم، مدیر مربوطه با گذرواژه و شناسه خود که قابل مشاهده
                                توسط مشتری می
                                باشد، اقدام لازم را بعمل خواهد آورد، این موضوع از لاگ هایی که به مشتری نمایش داده
                                میشود مشخص می
                                گردد.
                            </li>
                        </ul>
                    </div>
                    <div class="row">
                        <h3 class="w-100">7- خدمات</h3><br>
                        <ul class="mr-4">
                            <li>پس از قبول شرایط و پرداخت هزینه خدمات، شرکت به مشتری و کاربران مجاز آن مجوز غیر
                                انحصاری، غیر قابل
                                انتقال به غیر را برای استفاده از خدمات هلی سافت اعطا می نماید تا از نرم افزار
                                استفاده لازم و قانونی
                                را بنمایند.</li>
                            <li>شرکت بنا به درخواست منطقی مشتری، از وی پشتیبانی معقول را انجام خواهد داد.</li>
                            <li>شرکت این حق را بر خود محفوظ میدارد که سرویس های نرم افزار یا هر قسمت از آن را
                                هرازگاهی بدون اطلاع
                                قبلی و بدون محدودیت تغییر دهد و در ارتباط با این تغییرات هیچ گونه مسئولیتی در قبال
                                مشتری و اشخاص
                                ثالث ندارد.</li>
                        </ul>
                    </div>
                    <div class="row">
                        <h3 class="w-100">8- پردازش داده ها</h3><br>
                        <p>در هلی سافت اشخاصی که مجاز به پردازش داده های شخصی هستند، به محرمانه بودن متعهد شده اند و
                            توافقنامه عدم
                            افشاء را با شرکت امضاء نموده اند.</p>
                    </div>
                    <div class="row">
                        <h3 class="w-100">9- محدودیت ها</h3><br>
                        <ul class="mr-4">
                            <li>
                                مشتری و کاربران مجاز آن می¬توانند خدمات هلی سافت و یا هر قسمت یا عنصری از آن را، فقط
                                در محدوده
                                قانونی و معین شده، استفاده کنند و موارد زیر از جمله موارد استفاده برخلاف قانون و
                                سیاستهای شرکت و
                                موجب خدشه دار گردیدن مالکیت معنوی هلی سافت است:
                                <br>
                                - از خدمات هلی سافت و هر قسمت یا عنصری از آن را برای ارتکاب جرم استفاده نمایند و یا
                                قوانین را اجرا
                                نکنند.
                                <br>
                                - کپی، تکثیر، توزیع، اصلاح، هک، ایجاد کاربرهای مشتق، مهندسی معکوس، تجزیه مجدد خدمات
                                هلی سافت و یا هر
                                قسمت و عنصری از آن، یا تلاش برای استخراج کد منبع آن یا هرگونه خرابکاری و انتقال هر
                                نوع کرم و یا
                                ویروس یا کد نرم افزاری مخرب در سیستم هلی سافت.
                            </li>
                            <li>مشتری یا هر کاربر بدون رضایت کتبی (ایمیل، نمابر و غیره) قبلی شرکت نمی تواند: فروش،
                                فروش مجدد، اجاره،
                                ارائه، افشاء و بهره برداری و یا اعطای مجوز دسترسی یا خدمات هلی سافت را به طور کامل
                                یا جزئی برای هر
                                شخص ثالث در دسترس قرار دهد، مگر اینکه شخص ثالث، کاربر مجاز همان مشتری باشد.</li>
                        </ul>
                    </div>
                    <div class="row">
                        <h3 class="w-100">10- حریم خصوصی</h3><br>
                        <p>شرکت در راستای احترام به سیاست های حفظ حریم خصوصی مشتریان و کاربران نهایت دقت و تلاش لازم
                            را به عمل خواهد
                            آورد.</p>
                    </div>
                    <div class="row">
                        <h3 class="w-100">11- حقوق مالکیت معنوی هلی سافت</h3><br>
                        <ul class="mr-4">
                            <li>کلیه حقوق و مالکیت معنوی نامهای تجاری، علائم تجاری، سایر قطعات و عناصر هلی سافت،
                                متعلق به شرکت آرشا
                                سیستم جوان گرا تک می باشد.</li>
                            <li>هلی سافت به مشتری و کاربران مجاز آن یک مجوز غیر انحصاری را می دهد تا بتوانند بدون
                                ایجاد حق مالکیت و
                                عدم استفاده تجاری مطالب را بارگیری نموده البته با ذکر منبع و مشتری نباید هیچ محتوا
                                یا اطلاعاتی را که
                                از طریق شرکت به دست آورده یا مشتق شده کپی، توزیع یا منتشر کند.</li>
                            <li>هلی سافت هیچگونه مسئولیتی در قبال داده ها و یا اطلاعاتی که از جانب مشتری ارسال و یا
                                منتشر گردد را
                                نداشته و ندارد و همچنین مشتری مسئولیت کامل در مقابل استفاده از داده ها، اعم از کیفری
                                و حقوقی و غیره
                                را چه به صورت مستقیم و غیر مستقیم را برعهده دارد.</li>
                        </ul>
                    </div>
                    <div class="row">
                        <h3 class="w-100">12- سایتها، محصولات و خدمات شخص ثالث</h3><br>
                        <p>هلی سافت در صورت استفاده مشتری از سرویس ها، محصولات و خدمات شخص ثالث و متعاقبا ارائه
                            هرگونه اطلاعات از
                            طریق مشتری به این سرویس ها هیچگونه مسئولیتی را بر عهده نمی گیرد و بدیهی است قبل از ارائه
                            اطلاعات، مشتری
                            متعهد گردید که در مورد سیاست های حریم خصوصی و امنیتی اشخاص ثالث اطلاعات لازم را کسب
                            نمایند.</p>
                    </div>
                    <div class="row">
                        <h3 class="w-100">13- مسئولیت ها</h3><br>
                        <p>شرکت در قبال هرگونه محدودیت، خرابکاری، قطع یا تعلیق و یا در دسترس نبودن خدمات از قبیل
                            محدودیت های
                            اینترنتی، ایجاد محدودیت های شبکه داخلی شرکت ها، استفاده از مرورگر هایی که مورد تایید
                            شرکت نمی باشد و
                            غیره که سبب خراب شدن، از بین رفتن، عدم ثبت و ذخیره داده های مشتری و یا هر کس از کاربران
                            مرتبط با حساب
                            کاربری مشتری گردد هیچگونه مسئولیتی ندارد. بدیهی است دسترسی غیر مجاز اشخاص به اطلاعات و
                            داده های مشتری از
                            طریق داشتن گذرواژه و ورود به حساب کاربری مشتری، مسئولیت شرکت نمی باشد.</p>
                        <br>
                        <p>شرکت هیچگونه مسئولیتی از بابت و یا به سبب اتفاق های بوجود آمده فوق که به نظر مشتری منجر
                            به از دست رفتن
                            درآمد، سود حاصله و یا عدم النفع و غیره، چه به صورت مستقیم و یا غیر مستقیم و یا آسیب های
                            مشتری را ندارد و
                            همچنین است عدم استفاده صحیح یا ناتوانی مشتری در استفاده از محصول هلی سافت و عوامل مرتبط
                            با آن.</p>
                    </div>
                    <div class="row">
                        <h3 class="w-100">14- خاتمه توافق نامه</h3><br>
                        <p>در صورت احساس نیاز مشتری برای بستن حساب خود بایستی درخواست مربوطه را از طریق ایمیل
                            info.helisoft@gmail.com و یا نامه رسمی در سربرگ مشتری و با مهر و امضا معتبر ارسال و شرکت
                            آرشا سیستم جوان
                            گرا تک ۶ ماه پس از بستن و یا قطع حساب تمامی داده ها و اطلاعات مشتری را حذف مینماید. با
                            ذکر این مطلب که
                            این اطلاعات غیر قابل بازگشت می باشند.</p>
                        <br>
                        <p>در صورت تخلف و یا عدم رعایت تمام یا قسمتی از شرایط توافق نامه توسط مشتری و یا در صورت
                            هرگونه اعلام
                            اطلاعات خلاف واقع و انجام عمل منجر به نقض توافق و یا قوانین جاری از سوی مشتری، شرکت محق
                            است به مسدود
                            نمودن حساب مشتری و جبران خسارت وارده از محل وجوهات پرداخت شده بدون مراجعه به مراجع قضایی
                            و اداری است و
                            در صورت لزوم جهت جبران خسارات وارده اقدامات لازم به انجام خواهد رسید. </p>
                        <br>
                        <p>در صورت اتمام همکاری انجام موارد ذیل برای مشتری لازم است:
                            <br>
                            -استفاده از بسته های نرم افزاری شرکت و خدمات وابسته با آن را متوقف کند.
                            <br>
                            -مبالغی را که تحت هر عنوان به شرکت بدهکار است را پرداخت نماید.
                            <br>
                            -در صورتیکه شرکت لازم بداند و ظن آن باشد که دسترسی مشتری به هلی سافت، آسیبی به اشخاص
                            ثالث به بار خواهد
                            آورد، سریعا دسترسی مشتری را محدود و معلق خواهد کرد.
                        </p>
                    </div>
                    <div class="row">
                        <h3 class="w-100">15- قانون حاکم</h3><br>
                        <p>در صورت بروز اختلاف در اجرا و تفسیر این توافق نامه و پس از به نتیجه رسیدن گفتگوها فی
                            مابین طرفین و عدم
                            امکان صلح و سازش بین طرفین، دادگاههای عمومی و حقوقی کرمان با توافق طرفین صالح به رسیدگی
                            می باشند.</p>
                    </div>
                    <div class="row">
                        <h3 class="w-100">16- مقررات عمومی</h3><br>
                        <ul class="mr-4">
                            <li>در صورتی که به هر دلیلی یک شرط از شرایط این توافقنامه غیر قابل اجرا یا غیر قانونی
                                شناخته شود، این
                                موضوع بر تمامیت این توافقنامه اثری را مترتب نمی نماید.</li>
                            <li>مشتری نمیتواند به طور مستقیم یا غیر مستقیم، کامل یا جزئی هیچ یک از حقوق و یا تعهدات
                                خود را تحت این
                                شرایط بدون رضایت کتبی و قبلی هلی سافت، واگذار کند و هرگونه اقدام به واگذاری، انتقال
                                یا تفویض بدون
                                رضایت کتبی فاقد اعتبار و غیر قابل اجرا است و بدیهی است مشتری مسئول جبران تمامی
                                خسارات وارده اعم از
                                مادی و یا معنوی از هر نوع به اشخاص ثالث، کاربران و شرکت و غیره می باشد.</li>
                            <li>کلیه اعلامیه های مربوط به این توافقنامه، از طریق ایمیل و یا نامه رسمی می باشد، بدیهی
                                است مشتری باید
                                تمام موانع عدم دریافت ایمیل، فکس، پیامک و غیره را اصلاح نماید، در غیر اینصورت تمامی
                                عواقب این عدم
                                انجام فعل صرفا متوجه مشتری خواهد شد.</li>
                        </ul>
                    </div> --}}
                </div>
            </div>
        </div>
    </div>
</div>
@section('footer-scripts')
    <script type="text/javascript">
        $(document).ready(function() {

            $.ajaxSetup({
                headers: {
                    'X-CSRF-TOKEN': $('meta[name="csrf-token"]').attr('content')
                }
            });

            let loading = `
                    <div class="col text-center">
                        <span class="spinner-grow" role="status" aria-hidden="true"></span>
                    </div>`;

            $(document.body).on("click", "#save-register", function() {

                Swal.fire({
                    title: "{{ __('لطفا کمی صبر نمایید...') }}",
                    text: "{{ __('در حال پردازش هستیم.') }}",
                    icon: "info",
                    showCancelButton: false,
                    showConfirmButton: false,
                    allowOutsideClick: false
                });

                var name = $("#name").val();
                var family = $("#family").val();
                var city = $("#city").val();
                var town = $("#town").val();
                var center = $("#center").val();
                var package = $("#package").val();
                var phone = $("#phone").val();
                var mobile = $("#mobile").val();
                var address = $("#address").val();
                var username = $("#r-username").val();
                var password = $("#r-password").val();
                var terms = $("#terms-conditions").is(":checked");

                var e = checkEmpty();
                var m = checkMobile();

                if (e) {
                    Swal.fire({
                        title: "{{ __('اخطار') }}",
                        text: "{{ __('لطفا کادرهای ستاره دار را تکمیل نمایید.') }}",
                        icon: "error"
                    });
                } else if (m) {
                    Swal.fire({
                        title: "{{ __('اخطار') }}",
                        text: "{{ __('الگوی شماره موبایل وارد شده صحیح نمی باشد.') }}",
                        icon: "error"
                    });
                } else if (!terms) {
                    Swal.fire({
                        title: "{{ __('اخطار') }}",
                        text: "{{ __('لطفا قوانین را مطالعه و در صورت موافقت گزینه موافقم را تیک بزنید.') }}",
                        icon: "error"
                    });
                } else {
                    $.ajax({
                        type: "POST",
                        url: "{{ route('saveRegister') }}",
                        data: {
                            name: name,
                            family: family,
                            city: city,
                            town: town,
                            center: center,
                            package: package,
                            phone: phone,
                            mobile: mobile,
                            address: address,
                            username: username,
                            password: password
                        },
                        success: function(data) {

                            Swal.fire({
                                title: "{{ __('عملیات موفق') }}",
                                text: "{{ __('ثبت نام شما با موفقیت انجام و همکاران ما در اولین فرصت جهت آموزش با شما تماس خواهند گرفت.') }}",
                                icon: "success"
                            }).then((result) => {
                                if (result.isConfirmed) {
                                    window.location.href = "/login";
                                } else if (result.isDenied) {
                                    window.location.href = "/login";
                                }
                            });

                            $("#name").val("");
                            $("#family").val("");
                            $("#city").val("");
                            $("#town").val("");
                            $("#center").val("");
                            $("#package").val("");
                            $("#phone").val("");
                            $("#mobile").val("");
                            $("#address").val("");
                            $("#r-username").val("");
                            $("#r-password").val("");
                        },
                        error: function(data) {
                            Swal.fire({
                                title: "{{ __('اخطار') }}",
                                text: data.responseJSON.message,
                                icon: "error"
                            });
                        }
                    });
                }

            });
        });
    </script>
@stop
